partitioned-pipe-two-phase/fluid2-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid2;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid2-Mesh;
    patches           (inlet);
    
    readData
    (
      Velocity
      Alpha
    );
    
    writeData
    (
      Pressure
      VelocityGradient
      AlphaGradient
    );
  };
};

FF
{
  nameP   p_rgh;
  nameAlpha alpha.water;
}
